### https://pandas.pydata.org/pandas-docs/stable/reshaping.html

In [40]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [41]:
import numpy as np
import pandas as pd

In [25]:
df_wide = (
    pd.util.testing.makeTimeDataFrame(nper=3)
    .reset_index()
    .rename(columns={"index": "date"})
)

df_long = pd.melt(
    frame=df_wide, 
    id_vars=['date'], 
    var_name='var', 
    value_name='value'
)

In [26]:
df_wide

        date         A         B         C         D
0 2000-01-03 -0.437364  0.468147  0.004717 -0.487681
1 2000-01-04  0.018116 -0.294106  1.493559 -0.280424
2 2000-01-05  1.000827 -0.500252 -0.469975 -0.582073

In [27]:
df_long

         date var     value
0  2000-01-03   A -0.437364
1  2000-01-04   A  0.018116
2  2000-01-05   A  1.000827
3  2000-01-03   B  0.468147
4  2000-01-04   B -0.294106
5  2000-01-05   B -0.500252
6  2000-01-03   C  0.004717
7  2000-01-04   C  1.493559
8  2000-01-05   C -0.469975
9  2000-01-03   D -0.487681
10 2000-01-04   D -0.280424
11 2000-01-05   D -0.582073

In [33]:
x = df_long.pivot(index='date', columns='var', values='value')
x
x.columns
x.index
x.reset_index()

var                A         B         C         D
date
2000-01-03 -0.437364  0.468147  0.004717 -0.487681
2000-01-04  0.018116 -0.294106  1.493559 -0.280424
2000-01-05  1.000827 -0.500252 -0.469975 -0.582073

Index(['A', 'B', 'C', 'D'], dtype='object', name='var')

DatetimeIndex(['2000-01-03', '2000-01-04', '2000-01-05'], dtype='datetime64[ns]', name='date', freq=None)

var       date         A         B         C         D
0   2000-01-03 -0.437364  0.468147  0.004717 -0.487681
1   2000-01-04  0.018116 -0.294106  1.493559 -0.280424
2   2000-01-05  1.000827 -0.500252 -0.469975 -0.582073

In [35]:
x = df_long.pivot(index='date', columns='var')
x
x.columns
x.index

               value
var                A         B         C         D
date
2000-01-03 -0.437364  0.468147  0.004717 -0.487681
2000-01-04  0.018116 -0.294106  1.493559 -0.280424
2000-01-05  1.000827 -0.500252 -0.469975 -0.582073

MultiIndex(levels=[['value'], ['A', 'B', 'C', 'D']],
           labels=[[0, 0, 0, 0], [0, 1, 2, 3]],
           names=[None, 'var'])

DatetimeIndex(['2000-01-03', '2000-01-04', '2000-01-05'], dtype='datetime64[ns]', name='date', freq=None)

In [42]:
tuples = list(zip(*[
    ['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']
]))
tuples

index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

                     A         B
first second
bar   one     1.085418 -3.257129
      two    -0.845070  1.248946
baz   one    -0.217094  0.932834
      two     0.321242 -0.389083
foo   one     0.467757 -0.341453
      two    -1.210027 -0.340880
qux   one     1.241095  1.074987
      two    -0.749210 -0.330955

In [52]:
x = df[:4]
x
type(x)
x.index

                     A         B
first second
bar   one     1.085418 -3.257129
      two    -0.845070  1.248946
baz   one    -0.217094  0.932834
      two     0.321242 -0.389083

pandas.core.frame.DataFrame

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['first', 'second'])

In [54]:
x = df[:4].stack()
x
type(x)
x.index

first  second
bar    one     A    1.085418
               B   -3.257129
       two     A   -0.845070
               B    1.248946
baz    one     A   -0.217094
               B    0.932834
       two     A    0.321242
               B   -0.389083
dtype: float64

pandas.core.series.Series

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two'], ['A', 'B']],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 0, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second', None])

In [55]:
df[:4].stack().unstack()

                     A         B
first second
bar   one     1.085418 -3.257129
      two    -0.845070  1.248946
baz   one    -0.217094  0.932834
      two     0.321242 -0.389083

In [57]:
df[:4].stack().unstack(2)

                     A         B
first second
bar   one     1.085418 -3.257129
      two    -0.845070  1.248946
baz   one    -0.217094  0.932834
      two     0.321242 -0.389083

In [58]:
df[:4].stack().unstack(1)

second        one       two
first
bar   A  1.085418 -0.845070
      B -3.257129  1.248946
baz   A -0.217094  0.321242
      B  0.932834 -0.389083

In [59]:
df[:4].stack().unstack(0)

first          bar       baz
second
one    A  1.085418 -0.217094
       B -3.257129  0.932834
two    A -0.845070  0.321242
       B  1.248946 -0.389083

In [66]:
columns = pd.MultiIndex.from_tuples(
    [
        ('A', 'cat', 'long'), 
        ('B', 'cat', 'long'),
        ('A', 'dog', 'short'), 
        ('B', 'dog', 'short'),
    ],
    names=['exp', 'animal', 'hair_length']
)
columns.tolist()

df = pd.DataFrame(np.random.randn(4, 4), columns=columns)
df

df.stack(level=['animal', 'hair_length'])

[('A', 'cat', 'long'),
 ('B', 'cat', 'long'),
 ('A', 'dog', 'short'),
 ('B', 'dog', 'short')]

exp                 A         B         A         B
animal            cat       cat       dog       dog
hair_length      long      long     short     short
0            1.508175  0.942215  0.171020 -0.913426
1            0.754736  0.121337  1.171252  1.457587
2            0.934848  0.608934  0.513985 -0.022950
3            0.838539 -1.651187 -0.207647 -0.693183

exp                          A         B
  animal hair_length
0 cat    long         1.508175  0.942215
  dog    short        0.171020 -0.913426
1 cat    long         0.754736  0.121337
  dog    short        1.171252  1.457587
2 cat    long         0.934848  0.608934
  dog    short        0.513985 -0.022950
3 cat    long         0.838539 -1.651187
  dog    short       -0.207647 -0.693183